app/Views/admin/index.php

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `is_active` = '0'
---
                            Belum Aktivasi</div>
                        <div class="h5 mb-0 font-weight-bold text-gray-800">
                            <?php
                            $a = $modeluser->getUserWhere(['is_active' => '0'])->countAllResults();