app/Controllers/User.php

    public function index()
    {
        $modeluser = new ModelUser();
        $data['judul'] = 'Profil Saya';
        $data['user'] = $modeluser->cekData(['username' => session('username')])->getRowArray();
        $data['mahasiswa'] = $modeluser->joinMahasiswa(['username' => session('username')])->getRowArray();
        $data['dosen'] = $modeluser->joinDosen(['username' => session('username')])->getRowArray();
---
SELECT *
FROM `user`
JOIN `role` ON `user`.`role_id` = `role`.`id`
WHERE `username` = '40'

    private function _cekmhs()
    {
        $modeluser = new ModelUser();
        $uri = service('uri');
        $user = $modeluser->getUserWhere(['username' => $uri->getSegment(3)])->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = '40'

    private function _cekubah()
    {
        $modeluser = new ModelUser();
        $user = $modeluser->cekData(['username' => session('username')])->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = '101'