app/Models/ModelKuliah.php

SELECT *
FROM `nilai`
JOIN `mahasiswa` ON `nilai`.`nim` = `mahasiswa`.`nim`
WHERE `mahasiswa`.`nim` = '40'
---
    public function joinNilai($where)
    {
        return $this->db->table('nilai')->select('*')->join('mahasiswa', 'nilai.nim = mahasiswa.nim')->where($where)->get();