app/Models/ModelUser.php

SELECT COUNT(*) AS `numrows`
FROM `user`
---
    public function getCount(){
        return $this->db->table('user')->countAllResults();

UPDATE `mahasiswa` SET `nama` = 'Rakha', `tempatlahir` = 'Bekasi', `tanggallahir` = '01 Januari 2002', `jkel` = 'Pria', `email` = 'rakha@gmail.com', `fakultas` = 'Teknik dan Informatika', `prodi` = 'Ilmu Ekonomi', `alamat` = ''
WHERE `nim` = '40'
---
    public function updateMhs($data = null, $where = null)
    {
        $this->db->table('mahasiswa')->set($data)->where('nim', $where)->update();

UPDATE `dosen` SET `nama` = 'Wawan Kurniawan M.Kom', `tempatlahir` = 'Jakarta', `tanggallahir` = '01 Januari 1986', `jkel` = 'Pria', `email` = 'dosen101@gmail.com', `alamat` = 'Komplek Billymoon'
WHERE `nip` = '101'
---
    public function updateDosen($data = null, $where = null)
    {
        $this->db->table('dosen')->set($data)->where('nip', $where)->update();

SELECT *
FROM `mahasiswa`
JOIN `user` ON `user`.`username` = `mahasiswa`.`nim`
WHERE `username` = '40'
---
    public function joinMahasiswa($where = null)
    {
        return $this->db->table('mahasiswa')->select('*')->join('user', 'user.username = mahasiswa.nim')->where($where)->get();

SELECT *
FROM `dosen`
JOIN `user` ON `user`.`username` = `dosen`.`nip`
WHERE `username` = '40'
---
    public function joinDosen($where)
    {
        return $this->db->table('dosen')->select('*')->join('user', 'user.username = dosen.nip')->where($where)->get();